#1. Получите два целых числа (a и b) от пользователя, вычислите сумму чисел от a до b.
# a = int(input(">>>:"))
# b = int(input(">>>:"))
# sum = a
# while a < b:
#     a += 1
#     sum += a
# print(sum)

# 2. Создайте программу, которая получает от пользователя положительное целое число X и создайте функцию,
# которая вычисляет результат следующего уравнения.
# a = int(input("Введите число >>: "))
# rs = []
# for i in range(1, a+1):
#
#     for s in range(1,i + 1):
#         rs.append(s)
#
# print(sum(rs))




#3.Получите от пользователя четыре целых числа для переменных a, b, c, x и подставьте под формулу.
#Получите четыре ввода от пользователя и вызовите функцию, передав эти аргументы
# -Создайте функцию, которая принимает четыре аргумента x, a, b, c. Вернуть результат a * x ^ 2 + b * x + c

#
# def func(x, a, b, c):
#     return a * x**2 + b * x + c
# print(func(x = int(input('x>>:')),a=int(input('a>>:')),b=int(input('b>>:')),c=int(input('c>>:'))))

# a = int(input("Введите число >>: "))
# rs = []
# for i in range(1, a+1):
#
#     for s in range(1,i + 1):
#         rs.append(s)
#
# print(sum(rs))


#4 Создайте программу, которая переводит введённое число (от 1 до 20) в слово.
# Введите
# число: 4
# Результат: Четыре
#
# Введите
# число: 10
# Результат: Десять
#
# Введите
# число: 20
# # Результат: Двадцать
# a = {1: 'один', 2: 'два', 3: 'три', 4:'четыри', 5: 'пять', 6: 'шесть', 7: 'семь', 8: 'восемь', 9: 'девять', 10: 'десять',
# 11: 'одиннадцать', 12: 'двенадцать', 13: 'тринадцать', 14: 'четырнадцать', 15: 'пятнадцать', 16: 'шестнадцать',
# 17: 'семнадцать', 18: 'восемнадцать', 19: 'девятнадцать', 20: 'двадцать'}
# x = int(input('Введите число >>'))
# print(a[x])
